/* 
  Common.strings
  Secrets

  Created by Paulo Andrade on 29/11/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/

"Passphrase" = "Passphrase";
"ConfirmPassphrase" = "Confirm passphrase";
"EnterPassphrase" = "Enter your passphrase";


// password strength
"PasswordScore.VeryWeak" = "very weak";
"PasswordScore.Weak" = "weak";
"PasswordScore.OK" = "ok";
"PasswordScore.Good" = "good";
"PasswordScore.Excellent" = "excellent";


// Button titles
"Button.Show" = "Show";
"Button.Hide" = "Hide";
"Button.Copy" = "Copy";
"Button.Reveal" = "Reveal";
"Button.Conceal" = "Conceal";
"Button.Recover" = "Recover";
"Button.Trash" = "Trash";
"Button.MoveToTrash" = "Move to Trash";
"Button.Cancel" = "Cancel";
"Button.OK" = "OK";
"Button.Done" = "Done";
"Button.Continue" = "Continue";
"Button.Close" = "Close";
"Button.Edit" = "Edit";
"Button.Back" = "Back";
"Button.Fill" = "Fill";
"Button.Send" = "Send";
"Button.FillOptions" = "Fill…";
"Button.AssociateAndFill" = "Associate & Fill";
"Button.Delete" = "Delete";
"Button.Add" = "Add";
"Button.Restore" = "Restore";
"Button.Sync" = "Sync";
"Button.NotNow" = "Not now";
"Button.Update" = "Update";
"Button.ChangePassphrase" = "Change Passphrase";
"Button.Change" = "Change";
"Button.DeleteiCloudData" = "Delete iCloud Data";
"Button.YesSure" = "Yes, I'm sure";
"Button.YesDelete" = "Yes, delete";
"Button.Reset" = "Reset";
"Button.Unlock" = "Unlock";
"Button.Enable" = "Enable";
"Button.Disable" = "Disable";
"Button.Dismiss" = "Dismiss";
"Button.Refresh" = "Refresh";
"Button.Upgrade" = "Upgrade";

// Filters
"Filter.All" = "All";
"Filter.AllItems" = "All Items";
"Filter.Trash" = "Trash";


// Actions
/* Copy item action*/
"Action.CopyItem" = "Copy %@";
"Action.CopyItem2Lines" = "Copy\n%@";
"Action.RevealItem" = "Reveal %@";
"Action.ConcealItem" = "Conceal %@";
"Action.RecoverItem" = "Recover %@";
"Action.FillItem" = "Fill %@";
"Action.SendItem" = "Send %@ to requesting application";
"Action.MoveItemToTrash" = "Move %@ to trash";
"Action.DeleteItem" = "Delete %@";

// Search
/* Option presented when nothing is found for a given search string. Eg: Add Login for "twitter"*/
"Search.AddItem" = "Add %@ for \"%@\"";
/* Presented when nothing is found for a given search string. Eg: No logins found */
"Search.NoResultsTitle" = "No %@ found";
/* Presented when nothing is found for a given search string. Eg: Couldn't find any logins matching you search. */
"Search.NoResultsDetailed" = "Couldn't find any %@ matching you search.";
/* Trash is empty title */
"Search.TrashEmptyTitle" = "No trashed items";
/* Trash is empty message */
"Search.TrashEmptyMessage" = "Looks like you haven't sent any secrets to the trash.";
/* Empty section title */
"Search.SectionEmptyTitle" = "No %@ to show";
/* Empty section message */
"Search.SectionEmptyMessage" = "Add a %@ by pressing the + button above.";
/* Empty section message touch */
"Search.SectionEmptyMessageTouch" = "Add a %@ by pressing the + button below.";


// iCloud & Sync
"iCloud.CredentialItemName" = "%@ iCloud synchronization passphrase";
"iCloud.CredentialNoteContent" = "This entry was automatically generated while setting up iCloud. It's used internally to sync with iCloud.\n Feel free to change its name or/and username, but leave the password and the associated iCloud service intact. Thankyou :)";
/* Merge notice */
"Sync.AutomaticallyMergedNotice" = "Automatically merged due to conflict on %@";
/* Presented on a small overlay when the app is syncing */
"Sync.Syncing" = "Syncing";
/* Presented when iCloud sync is uploading the file data */
"Sync.WaitingForUpload" = "Waiting for upload to finish…";
/*  Last sync date */
"Sync.LastSynced" = "Last synced: %@";
/* Title for "passphrase not synced" alert */
"iCloud.ChangePassphraseAlert.Title" = "Your passphrase is not automatically synced via iCloud";
/* Message for "passphrase not synced" alert */
"iCloud.ChangePassphraseAlert.Message" = "You must update your passphrase manually on your other devices to continue using iCloud Sync.";

/* Asked during setup when iCloud data already exists */
"iCloud.ShouldRestore" = "Would you like to restore your data from iCloud?";
/* Asked during setup when creating a new iCloud store */
"iCloud.ShouldSync" = "Would you like to sync with iCloud?";

"iCloud.SetupFailedAlert.Title" = "Cound not enable iCloud Sync";
"iCloud.SetupFailedAlert.Message" = "Please try enabling it again later";
"iCloud.SetupFailedAlert.MessageTouch" = "Please try enabling it again later in Settings";

/* Presented during setup while checking for iCloud data */
"iCloud.CheckingiCloud" = "Checking iCloud…";

/* Alert title when trying to enable iCloud syncing */
"iCloud.NotAvailableAlert.Title" = "iCloud is not available";
/* Alert message when trying to enable iCloud syncing */
"iCloud.NotAvailableAlert.Message" = "Please make sure you are signed in to iCloud and have \"Documents & Data\" enabled in System Preferences.";
"iCloud.NotAvailableAlert.MessageTouch" = "Please make sure you are signed in to iCloud.";

/* Disable iCloud confirmation dialog title */
"iCloud.DisableSyncAlert.Title" = "Are you sure you want to disable iCloud sync?";
/* Disable iCloud confirmation dialog message */
"iCloud.DisableSyncAlert.Message" = "By disabling sync changes made on this device will not sync with iCloud and vice versa";

/* Delete iCloud confirmation dialog title */
"iCloud.DeleteDataAlert.Title" = "Are you sure you want to to delete your data from iCloud?";
/* Delete iCloud confirmation dialog message */
"iCloud.DeleteDataAlert.Message" = "This will prevent any other devices currently paired with your iCloud account from synchronizing. You'll have to reconfigure iCloud syncing in all of them.";

/* Sync with iCloud setting */
"iCloud.SyncSetting" = "Sync with iCloud";
/* Sync with iCloud explanation */
"iCloud.Info" = "iCloud Sync allows you to access your data on all your devices.";
/* iCloud Sync footer explanation when iCloud store file is missing */
"iCloud.Status.Missing" = "iCloud data is missing. You may have deleted it on another device. To re-enable iCloud syncing you'll need to disable and enable it again.";
/* iCloud Sync footer explanation when iCloud is unavailable but enabled */
"iCloud.Status.EnabledButUnavailable" = "iCloud is currently not accessible. You may be signed out of iCloud or signed in with a different user.";
/* iCloud Sync footer explanation when iCloud is unavailable and disabled */
"iCloud.Status.DisabledAndUnavailable" = "iCloud is currently not accessible. You may be signed out of iCloud.";



// Alerts
/* Delete multiple item confirmation alert title */
"Alert.PermanentlyDelete.Title" = "Permanently delete %d items";
/* Delete multiple item confirmation alert message */
"Alert.PermanentlyDelete.Message" = "Are you sure you want to permanently delete these %d items?";

"Alert.PremiumRequired.Title" = "Premium version required";
"Alert.PremiumRequired.Message" = "Upgrade to Premium to create and sync more than %d items.";

// Store
"Store.Version.Free" = "Free";
"Store.Version.Premium" = "Premium";

"Store.Button.Buy" = "Buy %@";
"Store.Button.Restore" = "Already purchased? Restore ≫";

"Store.PremiumUpgrade.Title" = "Upgrade to Premium";
"Store.PremiumUpgrade.Message" = "Upgrading enables unlimited items. This is a one-time purchase.";

"Store.ProcessingTransaction.Title" = "Processing…";
"Store.ProcessingTransaction.Message" = "Waiting for transaction to complete.";

"Store.HasPremium.Title" = "Premium Unlocked 🎉";
"Store.HasPremium.Message" = "You have the Premium version of Secrets. Thank you!";

"Store.WaitingOnTransaction.Title" = "Waiting for Authorization";
"Store.WaitingOnTransaction.Message" = "Your purchase is pending an approval from your family delegate.";

"Store.TransactionFailed.Title" = "Transaction Failed";
"Store.TransactionFailed.Message" = "Please retry your purchase.";

"Store.OtherPlaformNotIncluded" = "Premium for %@ sold separately.";

// New item
"NewItem.FreeVersionLimit" = "The Free version has a %d item limit.";
"NewItem.ItemsLeft" = "You can create %d more item(s).";

// Device Auth
/* Phrase for system's authentication prompt when unlocking secrets */
"DeviceAuthentication.AuthRequiredToUnlock" = "Authenticate to unlock your secrets";
"DeviceAuthentication.UnlockSecrets" = "Unlock your secrets";
